===================
throw
===================

throw "error";

---

(module
  (throw_statement (keyword) (string))
)

===================
conditional
===================

if (true) {
  a = 1;
}

---

(module
  (conditional_statement (keyword) (bool)
    (block
      (identifier) (operator) (integer)
    )
  )
)

===================
conditional with else
===================

if (true) {
  a = 1;
} else {
  b = 2;
}

---

(module
  (conditional_statement
    (keyword) (bool)
    (block
      (identifier) (operator) (integer)
    )
    (keyword)
    (block
      (identifier) (operator) (integer)
    )
  )
)


===================
parenthesis
===================

a = (1+1);

---

(module
  (identifier)
  (operator)
  (integer)
  (operator)
  (integer)
)

===================
subscript_expression
===================

a = b[1];

---

(module
  (identifier)
  (operator)
  (subscript_expression
    (identifier)
    (integer)
  )
)

===================
subscript_expression
===================

a = b[c + 1];

---

(module
  (identifier)
  (operator)
  (subscript_expression
    (identifier)
    (identifier)
    (operator)
    (integer)
  )
)


===================
unsafe cast
===================

cast x;

---

(module
  (cast_expression
    (keyword) (identifier)
  )
)

===================
safe cast
===================

cast (x, Int);

---

(module
  (cast_expression
    (keyword)
    (identifier)
    (type (identifier))
  )
)

===================
runtime type check
===================

(x : Type);

---

(module
  (runtime_type_check_expression
    (identifier) (type (identifier))
  )
)

===================
preprocessor macro
===================

#if !condition
trace(x);
#elseif (condition > 2)
trace(y);
#else
trace(z);
#end

---

(module
  (preprocessor_statement (operator) (identifier))
  (call_expression (identifier) (identifier))
  (preprocessor_statement (identifier) (operator) (integer))
  (call_expression (identifier) (identifier))
  (preprocessor_statement)
  (call_expression (identifier) (identifier))
  (preprocessor_statement)
)

===================
switch
===================

switch (x) {
  case 4: func();
}

---

(module
  (switch_expression (keyword) (identifier))
  (block
    (case_statement
      (keyword)
      (integer)
      (call_expression (identifier))
    )
  )
)

===================
switch multiple cases, default
===================

switch (x) {
  case 4: func();
  case 5: func();
  default: func();
}

---

(module
  (switch_expression (keyword) (identifier))
  (block
    (case_statement
      (keyword)
      (integer)
      (call_expression (identifier))
    )
    (case_statement
      (keyword)
      (integer)
      (call_expression (identifier))
    )
    (case_statement
      (keyword)
      (call_expression (identifier))
    )
  )
)

===================
case expr statement in case.
===================

case "1": func();

---

(module
  (case_statement
    (keyword)
    (string)
    (call_expression (identifier))
  )
)

===================
case expr with member_expression in case.
===================

case "1".code: func();

---

(module
  (case_statement
    (keyword)
    (member_expression (string) (identifier))
    (call_expression (identifier))
  )
)
