===================
call
===================

fn();

---

(module
  (call_expression (identifier))
)

===================
call with literal arg
===================

fn(1);

---

(module
  (call_expression (identifier) (integer))
)

===================
call with 3 literal args
===================

fn(1,2,3);

---

(module
  (call_expression (identifier)
    (integer)
    (integer)
    (integer)
  )
)


===================
call with variable arg
===================

fn(x);

---

(module
  (call_expression (identifier) (identifier))
)

===================
call with expression arg
===================

fn("Some" + "Combined" + "String");

---

(module
  (call_expression
    (identifier)
    (string)
    (operator)
    (string)
    (operator)
    (string)
  )
)

===================
call with type params
===================

fn<Int>(123);

---

(module
  (call_expression
    (identifier)
    (type_params
      (type (identifier))
    )
    (integer)
  )
)


===================
recursive call
===================

fn(fn(x));

---

(module
  (call_expression (identifier) (call_expression (identifier) (identifier)))
)

===================
package method call
===================

some.package.fn();

---

(module
  (call_expression
    (member_expression
      (identifier)
      (member_expression
        (identifier)
        (identifier)
      )
    )
  )
)

===================
package method call with safe navigation operator
===================

some.package?.fn();

---

(module
  (call_expression
    (member_expression
      (identifier)
      (member_expression
        (identifier)
        (identifier)
      )
    )
  )
)


===================
package member access with safe navigation operator
===================

some.package?.fn;

---

(module
	(member_expression
		(identifier)
		(member_expression
			(identifier)
			(identifier)
		)
	)
)


===================
compile time construct $type
===================

$type(0);

---

(module
  (type_trace_expression (keyword) (integer))
)
